MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECM064/mcu.h
extern volatile __OFF065bits_t OFF065bits __asm__ ("OFF065") __attribute__((section("sfrs"), address(0xBF810644)));
#define OFF066 OFF066
extern volatile uint32_t   OFF066 __attribute__((section("sfrs"), address(0xBF810648)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF066bits_t;
extern volatile __OFF066bits_t OFF066bits __asm__ ("OFF066") __attribute__((section("sfrs"), address(0xBF810648)));
#define OFF067 OFF067
extern volatile uint32_t   OFF067 __attribute__((section("sfrs"), address(0xBF81064C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF067bits_t;
extern volatile __OFF067bits_t OFF067bits __asm__ ("OFF067") __attribute__((section("sfrs"), address(0xBF81064C)));
#define OFF068 OFF068
extern volatile uint32_t   OFF068 __attribute__((section("sfrs"), address(0xBF810650)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF068bits_t;
extern volatile __OFF068bits_t OFF068bits __asm__ ("OFF068") __attribute__((section("sfrs"), address(0xBF810650)));
#define OFF069 OFF069
extern volatile uint32_t   OFF069 __attribute__((section("sfrs"), address(0xBF810654)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF069bits_t;
extern volatile __OFF069bits_t OFF069bits __asm__ ("OFF069") __attribute__((section("sfrs"), address(0xBF810654)));
#define OFF070 OFF070
extern volatile uint32_t   OFF070 __attribute__((section("sfrs"), address(0xBF810658)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF070bits_t;
extern volatile __OFF070bits_t OFF070bits __asm__ ("OFF070") __attribute__((section("sfrs"), address(0xBF810658)));
#define OFF071 OFF071
extern volatile uint32_t   OFF071 __attribute__((section("sfrs"), address(0xBF81065C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF071bits_t;
extern volatile __OFF071bits_t OFF071bits __asm__ ("OFF071") __attribute__((section("sfrs"), address(0xBF81065C)));
#define OFF072 OFF072
extern volatile uint32_t   OFF072 __attribute__((section("sfrs"), address(0xBF810660)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF072bits_t;
extern volatile __OFF072bits_t OFF072bits __asm__ ("OFF072") __attribute__((section("sfrs"), address(0xBF810660)));
#define OFF073 OFF073
extern volatile uint32_t   OFF073 __attribute__((section("sfrs"), address(0xBF810664)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF073bits_t;
extern volatile __OFF073bits_t OFF073bits __asm__ ("OFF073") __attribute__((section("sfrs"), address(0xBF810664)));
#define OFF074 OFF074
extern volatile uint32_t   OFF074 __attribute__((section("sfrs"), address(0xBF810668)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF074bits_t;
extern volatile __OFF074bits_t OFF074bits __asm__ ("OFF074") __attribute__((section("sfrs"), address(0xBF810668)));
#define OFF075 OFF075
extern volatile uint32_t   OFF075 __attribute__((section("sfrs"), address(0xBF81066C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF075bits_t;
extern volatile __OFF075bits_t OFF075bits __asm__ ("OFF075") __attribute__((section("sfrs"), address(0xBF81066C)));
#define OFF076 OFF076
extern volatile uint32_t   OFF076 __attribute__((section("sfrs"), address(0xBF810670)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF076bits_t;
extern volatile __OFF076bits_t OFF076bits __asm__ ("OFF076") __attribute__((section("sfrs"), address(0xBF810670)));
#define OFF077 OFF077
extern volatile uint32_t   OFF077 __attribute__((section("sfrs"), address(0xBF810674)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF077bits_t;
extern volatile __OFF077bits_t OFF077bits __asm__ ("OFF077") __attribute__((section("sfrs"), address(0xBF810674)));
#define OFF102 OFF102
extern volatile uint32_t   OFF102 __attribute__((section("sfrs"), address(0xBF8106D8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF102bits_t;
extern volatile __OFF102bits_t OFF102bits __asm__ ("OFF102") __attribute__((section("sfrs"), address(0xBF8106D8)));
#define OFF103 OFF103
extern volatile uint32_t   OFF103 __attribute__((section("sfrs"), address(0xBF8106DC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF103bits_t;
extern volatile __OFF103bits_t OFF103bits __asm__ ("OFF103") __attribute__((section("sfrs"), address(0xBF8106DC)));
#define OFF104 OFF104
extern volatile uint32_t   OFF104 __attribute__((section("sfrs"), address(0xBF8106E0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF104bits_t;
extern volatile __OFF104bits_t OFF104bits __asm__ ("OFF104") __attribute__((section("sfrs"), address(0xBF8106E0)));
#define OFF105 OFF105
extern volatile uint32_t   OFF105 __attribute__((section("sfrs"), address(0xBF8106E4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF105bits_t;
extern volatile __OFF105bits_t OFF105bits __asm__ ("OFF105") __attribute__((section("sfrs"), address(0xBF8106E4)));
#define OFF106 OFF106
extern volatile uint32_t   OFF106 __attribute__((section("sfrs"), address(0xBF8106E8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF106bits_t;
extern volatile __OFF106bits_t OFF106bits __asm__ ("OFF106") __attribute__((section("sfrs"), address(0xBF8106E8)));
#define OFF107 OFF107
extern volatile uint32_t   OFF107 __attribute__((section("sfrs"), address(0xBF8106EC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF107bits_t;
extern volatile __OFF107bits_t OFF107bits __asm__ ("OFF107") __attribute__((section("sfrs"), address(0xBF8106EC)));
#define OFF109 OFF109
extern volatile uint32_t   OFF109 __attribute__((section("sfrs"), address(0xBF8106F4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF109bits_t;
extern volatile __OFF109bits_t OFF109bits __asm__ ("OFF109") __attribute__((section("sfrs"), address(0xBF8106F4)));
#define OFF110 OFF110
extern volatile uint32_t   OFF110 __attribute__((section("sfrs"), address(0xBF8106F8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF110bits_t;
extern volatile __OFF110bits_t OFF110bits __asm__ ("OFF110") __attribute__((section("sfrs"), address(0xBF8106F8)));
#define OFF111 OFF111
extern volatile uint32_t   OFF111 __attribute__((section("sfrs"), address(0xBF8106FC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF111bits_t;
